//  4: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным


Console.WriteLine( "Введите номер недели: ");
string s_a = Console.ReadLine()!;

if (s_a == "1")
{
    Console.WriteLine("Нет, это не выходной день.");
}

else if (s_a == "2")
{
    Console.WriteLine("Нет, это не выходной день.");
}

else if (s_a == "3")
{
    Console.WriteLine("Нет, это не выходной день.");
}

else if (s_a == "4")
{
    Console.WriteLine("Нет, это не выходной день.");
}

else if (s_a == "5")
{
    Console.WriteLine("Нет, это не выходной день.");
}

else if (s_a == "6")
{
    Console.WriteLine("Да, это выходной! ");
}

else if (s_a == "7")
{
    Console.WriteLine("Да, это выходной!");
}

else
{
    Console.WriteLine("Err");
}
